for i in range(12):
    if(i%2!=1):
        k=i+1

        print(k)




    # Alexey
             # уже обсуждали, то что если табнуть то print будет в блоке
             # выполнения if и будет выводить k только в случае i%2!=1
             # если отсавить как есть то print выводит k ждый раз когда доходит
             # до конца итерации

#
# я беру переменную I которая существует от 0 до 12 (то есть типо месяцы в году)
# делю это I на 2 и если оно не равно 1 а делаиться без остатка , таким образом получаю все четные месяц ы
# потом к этим четным месяцам прибавляю один месяц, таким образом получаю все нечетные () то есть все правильно
#
# я сейчас поменял print - все получилось как надо (ОТЛИЧНО)