# tasks 1
# Написать функцию arithmetic, принимающую 3 аргумента:
# первые 2 - числа, третий - операция, которая должна быть произведена над ними.
# Если третий аргумент +, сложить их;
# если —, то вычесть;
# * — умножить; / — разделить (первое на второе). В остальных случаях вернуть строку "Неизвестная операция"

# a = int(input("Enter the number"))
# b = int(input("enter the number"))


# def arithmetic():
#     c = (a + b)
#     return c
#     d = (a - b)
#     return d
#     e = (a * b)
#     return e
#     f = (a / b)
#     return f


# print(arithmetic())

# заебало)) почему выводит только сумму а остальные операции не выводит ???
# я  расписывал получения в принте букв которые
# я делал через ретурн но он не дал ответа в итоге я попробовал вывод все функции
# при каких раскладах можно вывести неизвестную оперцию я вообще не понимаю




# tasks 2
# Написать функцию is_year_leap, принимающую 1 аргумент — год, и возвращающую True,
# если год високосный, и False иначе.

# year = input('enter the 356 or 366')


# def is_year_leap():
#     if year == 366:
#         return True
#     else:
#         year == 356
#         return False


# print(is_year_leap)

# чо за дичь он выдает хуй знает что вообще не понятно
# самый прикол что я не понимаю вообще что он выдает
# в чем проблема , все же правильно как я понимаю))
# я думаю проблема в синтаксисе



# tasks 3
# Написать функцию square, принимающую 1 аргумент — сторону квадрата,
# и возвращающую 3 значения (с помощью кортежа): периметр квадрата, площадь квадрата и диагональ квадрата

# a = int(input("Enter the number"))


# def square():
#     b = a * 4
#     c = a * 4
#     f = a + a
#     o = ('b','c','f')
#     l = tuple(o)
#     return l

# print(square())

# пиздос полный я добился кортежа ,
# но я не добился цифвровых ответов а добился только решения в буквах
# жесть, как это решать , полный пиздос



# tasks 4
# Написать функцию season, принимающую 1 аргумент — номер месяца (от 1 до 12),
# и возвращающую время года, которому этот месяц принадлежит (зима, весна, лето или осень)

# a = int(input"enter the number before 12")

# def seasons():
#     if a = 1, 2, 3:
#         print('winter')
#     elif a = 4, 5, 6:
#         print('spring')
#     else:
#         a = 7, 8, 9
#         print('summer')

# бля это пиздец полный я незнаю как это решать
# не идет и все
# здесь я не понимаю вообще в  оно только через иф идет сто пудова но для еще 3х месяцев не хвататет переменной

# tasks 5
# Пользователь делает вклад в размере a рублей сроком на years лет под 10% годовых
# (каждый год размер его вклада увеличивается на 10%. Эти деньги прибавляются к сумме вклада,
# и на них в следующем году тоже будут проценты).
# Написать функцию bank, принимающая аргументы a и years, и возвращающую сумму,
# которая будет на счету пользователя.

# var1:

# a = 50000
# years = 3

# def bank():
#     procent = 10
#     n = procent * years
#     for n in (a * 3):
#         print(n)


# bank()

# var2

# a = 50
# years = 3

# def bank():
#     n = a % 10
#     c = n * years
#     d = c + a
#     print(d)

# bank()

# почему бля он выдает такой ответ просто пиздец
# ебанная жесть каллит жестко

# промежуточный итог
# пиздец просто пиздец проблемав каком то нюансе который мешает нормально развиваться и решить эту проблему
# не одна задача не решена на сто процентов и нет вывода из каждой задачи
# сейчас я постраюсь по решать задачи с решениями что бы посмотреть логику



# tasks 6

# Напишите функцию Python для умножения всех чисел в списке.

# a = [2, 3, 4, 5]

# def multiplications():
#     n = [i*4 for i in a]
#     print(n)


# multiplications()

# пиздец щас все получилось при том что я не списывал ))))

