
# одна задача на вечер )))

# по сколько меня всегда интересовала как сделать клеточки для крестики нолики
# и у меня не получилось повторно целиком, пробую еще раз сейчас

#  print
#      "-------------"
#      for i in range(3):
#          print
#          "|", board[0 + i * 3], "|", board[1 + i * 3], "|", board[2 + i * 3], "|"
#          print
#         "-------------"


# он не воспроизводит крестики нолики не как и не запускает де баггер так как я через него
# хотел разобрать 10ую строку и 11ую


# minimal tasks

def concretica():
    f = {'money':'economica','footbal':'play','tambov':'old_city'}
    s = f.keys()
    print(s)
    d = f.values()
    print(d)

def concretica()

# он дает оштбку синтакисиса но я хоть убей не понимаю в чем дело