# Напишите программу на Python для подсчета количества строк,
# длина строки которых равна 2 или более,
# а первый и последний символ совпадают с заданным списком строк.
# Пример списка: ['abc', 'xyz', 'aba', '1221']

list_a = [6123,4356,12313,4757,123,6776,]
y = len(list_a)
print(y)

# первый способ

# второй способ
# a = [i for i in range(0,6)]
# print(a)